import folium


def get_position():
    """経度, 緯度情報"""
    pos = \
        {'清水寺': (34.994856, 135.785046),
         '二条城': (35.01423, 135.748218),
         '伏見稲荷': (34.96714, 135.772672),
         '金閣寺': (35.03937, 135.729243),
         'ギオンコーナー': (35.001551, 135.775822),
         '嵐山': (35.009449, 135.666773),
         '祇園': (35.003782, 135.777245),
         '八坂神社': (35.003656, 135.778553),
         '京都御所': (35.025414, 135.762125),
         '銀閣寺': (35.027021, 135.798206),
         '錦市場': (35.005008, 135.764902),
         '京都タワー': (34.987531, 135.759324),
         '京都駅': (34.985849, 135.758767),
         '龍安寺': (35.034494, 135.718263),
         '伏見': (34.932416, 135.771056),
         '東寺': (34.980598, 135.747786),
         '高台寺': (35.00051, 135.781218),
         '南禅寺': (35.011414, 135.794484),
         '東福寺': (32.834731, 130.755811),
         '平安神宮': (35.015982, 135.782426),
         '嵐山モンキーパーク': (35.011408, 135.676206),
         '東山': (34.992396, 135.775797),
         '河原町': (35.002111, 135.769279),
         '三十三間堂': (34.987885, 135.771713),
         '下鴨神社': (35.038037, 135.772773)}

    return pos


def view(route, init=(34.985849, 135.758767), zoom_start=13):
    """
     route を与えるとその route を図示したものを返す.
     route[i] : i 番目に訪れる観光地の名前
     init : mapを表示したときの中心地点 (標準は京都駅)
     zoom_start : mapを表示した時の初期の大きさ
    """
    pos = get_position()
    map = folium.Map(location=init, zoom_start=zoom_start)
    lines = []
    for i in range(len(route) - 1):
        lines.append({"from": pos[route[i]], "to": pos[route[i + 1]]})

    for line in lines:
        folium.PolyLine(
            locations=[line["from"], line["to"]]
        ).add_to(map)

    return map


if __name__ == "__main__":
    route = ['京都駅', '二条城', '伏見稲荷', '京都タワー', '清水寺', 'ギオンコーナー', '祇園']
    view(route)
